Masmiseim36/nxpSDK/devices/MKV44F16/mcuxpresso/startup_mkv44f16.c
//*****************************************************************************
// MKV44F16 startup code for use with MCUXpresso IDE
//
// Version : 180919
//*****************************************************************************
//
// Copyright 2016-2019 NXP
// All rights reserved.
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************

#if defined (DEBUG)
#pragma GCC push_options
#pragma GCC optimize ("Og")
#endif // (DEBUG)

#if defined (__cplusplus)
#ifdef __REDLIB__
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
    extern void __libc_init_array(void);
}
#endif
#endif

#define WEAK __attribute__ ((weak))
#define WEAK_AV __attribute__ ((weak, section(".after_vectors")))
#define ALIAS(f) __attribute__ ((weak, alias (#f)))

//*****************************************************************************
#if defined (__cplusplus)
extern "C" {
#endif

//*****************************************************************************
// Flash Configuration block : 16-byte flash configuration field that stores
// default protection settings (loaded on reset) and security information that
// allows the MCU to restrict access to the Flash Memory module.
// Placed at address 0x400 by the linker script.
//*****************************************************************************
__attribute__ ((used,section(".FlashConfig"))) const struct {
    unsigned int word1;
    unsigned int word2;
    unsigned int word3;
    unsigned int word4;
} Flash_Config = {0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFF, 0xFFFFFFFE};
//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
#if defined (__USE_CMSIS)
extern void SystemInit(void);
#endif // (__USE_CMSIS)

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
     void ResetISR(void);
WEAK void NMI_Handler(void);
WEAK void HardFault_Handler(void);
WEAK void MemManage_Handler(void);
WEAK void BusFault_Handler(void);
WEAK void UsageFault_Handler(void);
WEAK void SVC_Handler(void);
WEAK void DebugMon_Handler(void);
WEAK void PendSV_Handler(void);
WEAK void SysTick_Handler(void);
WEAK void IntDefaultHandler(void);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void DMA0_IRQHandler(void);
WEAK void DMA1_IRQHandler(void);
WEAK void DMA2_IRQHandler(void);
WEAK void DMA3_IRQHandler(void);
WEAK void DMA4_IRQHandler(void);
WEAK void DMA5_IRQHandler(void);
WEAK void DMA6_IRQHandler(void);
WEAK void DMA7_IRQHandler(void);
WEAK void DMA8_IRQHandler(void);
WEAK void DMA9_IRQHandler(void);
WEAK void DMA10_IRQHandler(void);
WEAK void DMA11_IRQHandler(void);
WEAK void DMA12_IRQHandler(void);
WEAK void DMA13_IRQHandler(void);
WEAK void DMA14_IRQHandler(void);
WEAK void DMA15_IRQHandler(void);
WEAK void DMA_Error_IRQHandler(void);
WEAK void MCM_IRQHandler(void);
WEAK void FTFA_IRQHandler(void);
WEAK void FTFA_Collision_IRQHandler(void);
WEAK void PMC_IRQHandler(void);
WEAK void LLWU_IRQHandler(void);
WEAK void WDOG_EWM_IRQHandler(void);
WEAK void Reserved39_IRQHandler(void);
WEAK void I2C0_IRQHandler(void);
WEAK void Reserved41_IRQHandler(void);
WEAK void SPI0_IRQHandler(void);
WEAK void Reserved43_IRQHandler(void);
WEAK void Reserved44_IRQHandler(void);
WEAK void Reserved45_IRQHandler(void);
WEAK void Reserved46_IRQHandler(void);
WEAK void UART0_RX_TX_IRQHandler(void);
WEAK void UART0_ERR_IRQHandler(void);
WEAK void UART1_RX_TX_IRQHandler(void);
WEAK void UART1_ERR_IRQHandler(void);
WEAK void Reserved51_IRQHandler(void);
WEAK void Reserved52_IRQHandler(void);
WEAK void Reserved53_IRQHandler(void);
WEAK void ADC_ERR_IRQHandler(void);
WEAK void ADCA_IRQHandler(void);
WEAK void CMP0_IRQHandler(void);
WEAK void CMP1_IRQHandler(void);
WEAK void Reserved58_IRQHandler(void);
WEAK void Reserved59_IRQHandler(void);
WEAK void Reserved60_IRQHandler(void);
WEAK void Reserved61_IRQHandler(void);
WEAK void Reserved62_IRQHandler(void);
WEAK void Reserved63_IRQHandler(void);
WEAK void PIT0_IRQHandler(void);
WEAK void PIT1_IRQHandler(void);
WEAK void PIT2_IRQHandler(void);
WEAK void PIT3_IRQHandler(void);
WEAK void PDB0_IRQHandler(void);
WEAK void Reserved69_IRQHandler(void);
WEAK void XBARA_IRQHandler(void);
WEAK void PDB1_IRQHandler(void);
WEAK void DAC0_IRQHandler(void);
WEAK void MCG_IRQHandler(void);
WEAK void LPTMR0_IRQHandler(void);
WEAK void PORTA_IRQHandler(void);
WEAK void PORTB_IRQHandler(void);
WEAK void PORTC_IRQHandler(void);
WEAK void PORTD_IRQHandler(void);
WEAK void PORTE_IRQHandler(void);
WEAK void SWI_IRQHandler(void);
WEAK void Reserved81_IRQHandler(void);
WEAK void ENC0_COMPARE_IRQHandler(void);
WEAK void ENC0_HOME_IRQHandler(void);
WEAK void ENC0_WDOG_SAB_IRQHandler(void);
WEAK void ENC0_INDEX_IRQHandler(void);
WEAK void CMP2_IRQHandler(void);
WEAK void Reserved87_IRQHandler(void);
WEAK void Reserved88_IRQHandler(void);
WEAK void ADCB_IRQHandler(void);
WEAK void Reserved90_IRQHandler(void);
WEAK void CAN0_ORed_Message_buffer_IRQHandler(void);
WEAK void CAN0_Bus_Off_IRQHandler(void);
WEAK void CAN0_Error_IRQHandler(void);
WEAK void CAN0_Tx_Warning_IRQHandler(void);
WEAK void CAN0_Rx_Warning_IRQHandler(void);
WEAK void CAN0_Wake_Up_IRQHandler(void);
WEAK void PWMA_CMP0_IRQHandler(void);
WEAK void PWMA_RELOAD0_IRQHandler(void);
WEAK void PWMA_CMP1_IRQHandler(void);
WEAK void PWMA_RELOAD1_IRQHandler(void);
WEAK void PWMA_CMP2_IRQHandler(void);
WEAK void PWMA_RELOAD2_IRQHandler(void);
WEAK void PWMA_CMP3_IRQHandler(void);
WEAK void PWMA_RELOAD3_IRQHandler(void);
WEAK void PWMA_CAP_IRQHandler(void);
WEAK void PWMA_RERR_IRQHandler(void);
WEAK void PWMA_FAULT_IRQHandler(void);
WEAK void CMP3_IRQHandler(void);
WEAK void Reserved109_IRQHandler(void);
WEAK void CAN1_ORed_Message_buffer_IRQHandler(void);
WEAK void CAN1_Bus_Off_IRQHandler(void);
WEAK void CAN1_Error_IRQHandler(void);
WEAK void CAN1_Tx_Warning_IRQHandler(void);
WEAK void CAN1_Rx_Warning_IRQHandler(void);
WEAK void CAN1_Wake_Up_IRQHandler(void);

//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the IntDefaultHandler, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void DMA0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA4_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA5_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA6_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA7_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA8_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA9_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA10_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA11_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA12_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA13_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA14_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA15_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DMA_Error_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MCM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTFA_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void FTFA_Collision_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PMC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LLWU_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void WDOG_EWM_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved39_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void I2C0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved41_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SPI0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved43_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved44_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved45_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved46_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void UART0_RX_TX_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void UART0_ERR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void UART1_RX_TX_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void UART1_ERR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved51_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved52_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved53_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ADC_ERR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ADCA_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CMP0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CMP1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved58_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved59_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved60_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved61_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved62_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved63_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIT0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIT1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIT2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PIT3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDB0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved69_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void XBARA_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PDB1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void DAC0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void MCG_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void LPTMR0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PORTA_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PORTB_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PORTC_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PORTD_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PORTE_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void SWI_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved81_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ENC0_COMPARE_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ENC0_HOME_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ENC0_WDOG_SAB_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ENC0_INDEX_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CMP2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved87_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved88_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void ADCB_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved90_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWMA_CMP0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWMA_RELOAD0_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWMA_CMP1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWMA_RELOAD1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWMA_CMP2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWMA_RELOAD2_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWMA_CMP3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWMA_RELOAD3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWMA_CAP_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWMA_RERR_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void PWMA_FAULT_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CMP3_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void Reserved109_DriverIRQHandler(void) ALIAS(IntDefaultHandler);
void CAN1_DriverIRQHandler(void) ALIAS(IntDefaultHandler);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined (__REDLIB__)
extern void __main(void);
#endif
extern int main(void);

//*****************************************************************************
// External declaration for the pointer to the stack top from the Linker Script
//*****************************************************************************
extern void _vStackTop(void);
//*****************************************************************************
#if defined (__cplusplus)
} // extern "C"
#endif
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************
extern void (* const g_pfnVectors[])(void);
extern void * __Vectors __attribute__ ((alias ("g_pfnVectors")));

__attribute__ ((used, section(".isr_vector")))
void (* const g_pfnVectors[])(void) = {
    // Core Level - CM4
    &_vStackTop,                       // The initial stack pointer
    ResetISR,                          // The reset handler
    NMI_Handler,                       // The NMI handler
    HardFault_Handler,                 // The hard fault handler
    MemManage_Handler,                 // The MPU fault handler
    BusFault_Handler,                  // The bus fault handler
    UsageFault_Handler,                // The usage fault handler
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    0,                                 // Reserved
    SVC_Handler,                       // SVCall handler
    DebugMon_Handler,                  // Debug monitor handler
    0,                                 // Reserved
    PendSV_Handler,                    // The PendSV handler
    SysTick_Handler,                   // The SysTick handler

    // Chip Level - MKV44F16
    DMA0_IRQHandler,                      // 16 : DMA channel 0, 16 transfer complete
    DMA1_IRQHandler,                      // 17 : DMA channel 1, 17 transfer complete
    DMA2_IRQHandler,                      // 18 : DMA channel 2, 18 transfer complete
    DMA3_IRQHandler,                      // 19 : DMA channel 3, 19 transfer complete
    DMA4_IRQHandler,                      // 20 : DMA channel 4, 20 transfer complete
    DMA5_IRQHandler,                      // 21 : DMA channel 5, 21 transfer complete
    DMA6_IRQHandler,                      // 22 : DMA channel 6, 22 transfer complete
    DMA7_IRQHandler,                      // 23 : DMA channel 7, 23 transfer complete
    DMA8_IRQHandler,                      // 24 : DMA channel 8, 24 transfer complete
    DMA9_IRQHandler,                      // 25 : DMA channel 9, 25 transfer complete
    DMA10_IRQHandler,                     // 26 : DMA channel 10, 26 transfer complete
    DMA11_IRQHandler,                     // 27 : DMA channel 11, 27 transfer complete
    DMA12_IRQHandler,                     // 28 : DMA channel 12, 28 transfer complete
    DMA13_IRQHandler,                     // 29 : DMA channel 13, 29 transfer complete
    DMA14_IRQHandler,                     // 30 : DMA channel 14, 30 transfer complete
    DMA15_IRQHandler,                     // 31 : DMA channel 15, 31 transfer complete
    DMA_Error_IRQHandler,                 // 32 : DMA error interrupt channels 0-1531
    MCM_IRQHandler,                       // 33 : MCM interrupt
    FTFA_IRQHandler,                      // 34 : Command complete
    FTFA_Collision_IRQHandler,            // 35 : Read collision
    PMC_IRQHandler,                       // 36 : Low-voltage detect, low-voltage warning
    LLWU_IRQHandler,                      // 37 : Low Leakage Wakeup
    WDOG_EWM_IRQHandler,                  // 38 : Both watchdog modules share this interrupt
    Reserved39_IRQHandler,                // 39 : Reserved interrupt
    I2C0_IRQHandler,                      // 40 : I2C0
    Reserved41_IRQHandler,                // 41 : Reserved interrupt
    SPI0_IRQHandler,                      // 42 : SPI0
    Reserved43_IRQHandler,                // 43 : Reserved interrupt
    Reserved44_IRQHandler,                // 44 : Reserved interrupt
    Reserved45_IRQHandler,                // 45 : Reserved interrupt
    Reserved46_IRQHandler,                // 46 : Reserved interrupt
    UART0_RX_TX_IRQHandler,               // 47 : UART0 status sources
    UART0_ERR_IRQHandler,                 // 48 : UART0 error sources
    UART1_RX_TX_IRQHandler,               // 49 : UART1 status sources
    UART1_ERR_IRQHandler,                 // 50 : UART1 error sources
    Reserved51_IRQHandler,                // 51 : Reserved interrupt
    Reserved52_IRQHandler,                // 52 : Reserved interrupt
    Reserved53_IRQHandler,                // 53 : Reserved interrupt
    ADC_ERR_IRQHandler,                   // 54 : ADC_ERR A and B ( zero cross, high/low limit)
    ADCA_IRQHandler,                      // 55 : ADCA Scan complete
    CMP0_IRQHandler,                      // 56 : CMP0
    CMP1_IRQHandler,                      // 57 : CMP1
    Reserved58_IRQHandler,                // 58 : Reserved interrupt
    Reserved59_IRQHandler,                // 59 : Reserved interrupt
    Reserved60_IRQHandler,                // 60 : Reserved interrupt
    Reserved61_IRQHandler,                // 61 : Reserved interrupt
    Reserved62_IRQHandler,                // 62 : Reserved interrupt
    Reserved63_IRQHandler,                // 63 : Reserved interrupt
    PIT0_IRQHandler,                      // 64 : PIT Channel 0
    PIT1_IRQHandler,                      // 65 : PIT Channel 1
    PIT2_IRQHandler,                      // 66 : PIT Channel 2
    PIT3_IRQHandler,                      // 67 : PIT Channel 3
    PDB0_IRQHandler,                      // 68 : PDB0
    Reserved69_IRQHandler,                // 69 : Reserved interrupt
    XBARA_IRQHandler,                     // 70 : XBARA
    PDB1_IRQHandler,                      // 71 : PDB1
    DAC0_IRQHandler,                      // 72 : DAC0
    MCG_IRQHandler,                       // 73 : MCG
    LPTMR0_IRQHandler,                    // 74 : LPTMR0
    PORTA_IRQHandler,                     // 75 : Pin detect (Port A)
    PORTB_IRQHandler,                     // 76 : Pin detect (Port B)
    PORTC_IRQHandler,                     // 77 : Pin detect (Port C)
    PORTD_IRQHandler,                     // 78 : Pin detect (Port D)
    PORTE_IRQHandler,                     // 79 : Pin detect (Port E)
    SWI_IRQHandler,                       // 80 : Software
    Reserved81_IRQHandler,                // 81 : Reserved interrupt
    ENC0_COMPARE_IRQHandler,              // 82 : ENC0 Compare
    ENC0_HOME_IRQHandler,                 // 83 : ENC0 Home
    ENC0_WDOG_SAB_IRQHandler,             // 84 : ENC0 Watchdog/Simultaneous A and B change
    ENC0_INDEX_IRQHandler,                // 85 : ENC0 Index/Roll over/Roll Under
    CMP2_IRQHandler,                      // 86 : CMP2
    Reserved87_IRQHandler,                // 87 : Reserved interrupt
    Reserved88_IRQHandler,                // 88 : Reserved interrupt
    ADCB_IRQHandler,                      // 89 : ADCB Scan complete
    Reserved90_IRQHandler,                // 90 : Reserved interrupt
    CAN0_ORed_Message_buffer_IRQHandler,  // 91 : FLexCAN0 OR'ed Message buffer (0-15)
    CAN0_Bus_Off_IRQHandler,              // 92 : FLexCAN0 Bus Off
    CAN0_Error_IRQHandler,                // 93 : FLexCAN0 Error
    CAN0_Tx_Warning_IRQHandler,           // 94 : FLexCAN0 Transmit Warning
    CAN0_Rx_Warning_IRQHandler,           // 95 : FLexCAN0 Receive Warning
    CAN0_Wake_Up_IRQHandler,              // 96 : FLexCAN0 Wake Up
    PWMA_CMP0_IRQHandler,                 // 97 : eFlexPWM submodule 0 Compare
    PWMA_RELOAD0_IRQHandler,              // 98 : eFlexPWM submodule 0 Reload
    PWMA_CMP1_IRQHandler,                 // 99 : eFlexPWM submodule 1 Compare
    PWMA_RELOAD1_IRQHandler,              // 100: eFlexPWM submodule 1 Reload
    PWMA_CMP2_IRQHandler,                 // 101: eFlexPWM submodule 2 Compare
    PWMA_RELOAD2_IRQHandler,              // 102: eFlexPWM submodule 2 Reload
    PWMA_CMP3_IRQHandler,                 // 103: eFlexPWM submodule 3 Compare
    PWMA_RELOAD3_IRQHandler,              // 104: eFlexPWM submodule 3 Reload
    PWMA_CAP_IRQHandler,                  // 105: eFlexPWM all input captures
    PWMA_RERR_IRQHandler,                 // 106: eFlexPWM reload error
    PWMA_FAULT_IRQHandler,                // 107: eFlexPWM Fault
    CMP3_IRQHandler,                      // 108: CMP3
    Reserved109_IRQHandler,               // 109: Reserved interrupt
    CAN1_ORed_Message_buffer_IRQHandler,  // 110: FLexCAN1 OR'ed Message buffer (0-15)
    CAN1_Bus_Off_IRQHandler,              // 111: FLexCAN1 Bus Off
    CAN1_Error_IRQHandler,                // 112: FLexCAN1 Error
    CAN1_Tx_Warning_IRQHandler,           // 113: FLexCAN1 Transmit Warning
    CAN1_Rx_Warning_IRQHandler,           // 114: FLexCAN1 Receive Warning
    CAN1_Wake_Up_IRQHandler,              // 115: FLexCAN1 Wake Up

}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

